def choise_sort(va): # Вибір алгоритму сортування
    if va == 1:
        print(f'Початковий масив:\n{n}')
        bubble_sort(n)
        print(f'Відсортований масив:\n{n}')
    elif va == 2:
        print(f'Початковий масив:\n{n}')
        selection_sort(n)
        print(f'Відсортований масив:\n{n}')
    elif va == 3:
        print(f'Початковий масив:\n{n}')
        insertion_sort(n)
        print(f'Відсортований масив:\n{n}')

def bubble_sort(a): # сортування бульбашкою
    o,p=0,0
    v = int(input(f'Виберіть варіант:\n1 - сортувати в порядку зростання;\n2 - сотрувати в порядку спадання\nВведіть число: '))
    flag = True
    while flag:
        flag = False
        for i in range(len(a) - 1):
            if v == 1: # сортування в порядку зростання
                if a[i] > a[i + 1]:
                    a[i], a[i + 1] = a[i + 1], a[i]
                    flag = True
                    o+=1 # розрахунок кількості обмінів
                p += 1
            if v == 2: # сортування в порядку спадання
                if a[i] < a[i + 1]:
                    a[i], a[i + 1] = a[i + 1], a[i]
                    flag = True
                    o+=1 # розрахунок кількості обмінів
                p+=1 # розрахунок кількості порівнянь
    print(f'Кількість обмінів = {o}')
    print(f'Кількість порівнянь = {p}')

def selection_sort(a): # сортування вибором
    o, p = 0, 0
    v = int(input(f'Виберіть варіант:\n1 - сортувати в порядку зростання;\n2 - сотрувати в порядку спадання\nВведіть число: '))
    for i in range(len(a) - 1):
        min = i
        for j in range(i + 1, len(a)):
            if v == 1: # сортування в порядку зростання
                if a[j] < a[min]:
                    min = j
                    p+=1 # розрахунок кількості порівнянь
                a[i], a[min] = a[min], a[i]
                o+=1 # розрахунок кількості обмінів
            if v == 2: # сортування в порядку спадання
                if a[j] > a[min]:
                    min = j
                    p+=1 # розрахунок кількості порівнянь
                a[i], a[min] = a[min], a[i]
                o+=1 # розрахунок кількості обмінів
    print(f'Кількість обмінів = {o}')
    print(f'Кількість порівнянь = {p}')

def insertion_sort(a): # сортування вставками
    o, p = 0, 0
    v = int(input(f'Виберіть варіант:\n1 - сортувати в порядку зростання;\n2 - сотрувати в порядку спадання\nВведіть число: '))
    for i in range(1, len(a)):
        j = i - 1
        key = a[i]
        if v == 1: # сортування в порядку зростання
            while j >= 0 and a[j] > key:
                a[j+1] = a[j]
                j -= 1
                o+=1 # розрахунок кількості обмінів
            a[j + 1] = key
            p+=1 # розрахунок кількості порівнянь
        if v == 2: # сортування в порядку спадання
            while j >= 0 and a[j] < key:
                a[j+1] = a[j]
                j -= 1
                o+=1 # розрахунок кількості обмінів
            a[j + 1] = key
            p+=1 # розрахунок кількості порівнянь
    print(f'Кількість обмінів = {o}')
    print(f'Кількість порівнянь = {p}')

var = int(input('\n1 - генерація масиву з рандомних чисел; \n2 - заповнити масив самостійно; \nвведіть число: '))
if var == 1: # генерація масиву з випадкових чисел, параметри задаються користувачем
    import numpy as np
    import random
    k=int(input(f'Введіть кількість елементів масиву: '))
    n = np.zeros(k, dtype=int)
    d1=int(input(f'Введіть початкову границю діапазона чисел для генерації масиву: ')) # користувач вводить start
    d2=int(input(f'Введіть кінцеву границю діапазона чисел для генерації масиву: ')) # користувач вводить stop
    for i in range(k):
        n[i] = random.randint(d1,d2)
    va = int(input('Виберіть алгоритм сортування:\n1 - bubble sort;\n2 - selection sort;\n3 - insertion sort\nвведіть число: '))
    choise_sort(va) # вибір алгоритму сортування, рядок № 2
elif var == 2: # користувач самостійно вводить числа до масиву, параметри задаються користувачем
    import numpy as np
    k = int(input(f'Введіть кількість елементів масиву: '))
    n = np.zeros(k, dtype=int)
    for i in range(k):
        n[i] = int(input('Почергово введіть елементи масиву: '))
    va = int(input('Виберіть алгоритм сортування:\n1 - bubble sort; \n2 - selection sort; \n3 - insertion sort \nвведіть число: ')) # вибір алгоритму сортування користувачем
    choise_sort(va) # вибір алгоритму сортування, рядок № 2
